#pragma once
#include "Repository.h"

class Repository;

class MeRepository : public Repository
{
protected:
    std::map<std::wstring, std::vector<std::wstring>> map = {
    {L"会下蛋的动物", {
        L"鳄霸", L"地包天", L"阿瓜", L"阿呆", L"木木", L"柯蒂斯", L"锤子", L"咕咕", L"布鲁斯", L"阿宝", L"豆豆", L"泰雷斯"
    }},
    {L"会潜水的动物", {
        L"鳄霸", L"瓦特", L"阿瓜", L"阿呆", L"图斯卡尔", L"锤子", L"布鲁斯", L"阿宝", L"哈士企"
    }},
    {L"会飞的动物", {
        L"阿瓜", L"阿呆", L"木木", L"咕咕", L"优罗莎", L"暴莉", L"阿宝"
    }},
    {L"吃植物的动物", {
        L"卡洛特", L"培根", L"芭比", L"瓦力", L"莫斯", L"阿瓜", L"阿呆", L"柯蒂斯", L"白菜狗", L"咕咕", L"优罗莎",
        L"宝伯", L"小新", L"可乐", L"高非", L"奥姆诺姆", L"豆豆", L"福吉", L"福宝"
    }},
    {L"吃肉的动物", {
        L"尼莫", L"鳄霸", L"地包天", L"玛奇朵", L"瓦特", L"泰哥", L"斯帕奇", L"图斯卡尔", L"八公", L"加肥", L"珞珞",
        L"木木", L"毛毛", L"麦克斯", L"锤子", L"利威尔", L"布鲁斯", L"希子", L"卡托", L"雪诺", L"嘟嘟", L"刺头", L"桑尼",
        L"玛奈奇", L"山姆", L"哈士企", L"苗苗", L"星期天", L"罗恩", L"斯黛拉"
    }},
    {L"头上长角的动物", {
        L"地包天", L"瓦力", L"莫斯", L"柯蒂斯", L"暴莉", L"咩咩", L"阿宝"
    }},
    {L"尾巴长的动物", {
        L"鳄霸", L"地包天", L"玛奇朵", L"泰哥", L"斯帕奇", L"八公", L"加肥", L"珞珞", L"毛毛", L"麦克斯", L"柯蒂斯",
        L"锤子", L"利威尔", L"咕咕", L"布鲁斯", L"奥里", L"希子", L"卡托", L"雪诺", L"嘟嘟", L"阿宝", L"玛奈奇", L"山姆",
        L"福吉", L"苗苗", L"星期天"
    }},
    {L"毛茸茸的动物", {
        L"尼莫", L"玛奇朵", L"卡洛特", L"瓦特", L"泰哥", L"芭比", L"瓦力", L"莫斯", L"八公", L"加肥", L"珞珞", L"毛毛",
        L"麦克斯", L"利威尔", L"希子", L"卡托", L"宝伯", L"咩咩", L"雪诺", L"嘟嘟", L"刺头", L"可乐", L"阿宝", L"高非",
        L"玛奈奇", L"山姆", L"福吉", L"福宝", L"哈士企", L"苗苗", L"星期天", L"罗恩", L"斯黛拉"
    }},
    {L"犬科动物", {
        L"尼莫", L"斯帕奇", L"八公", L"珞珞", L"毛毛", L"麦克斯", L"白菜狗", L"卡托", L"雪诺", L"桑尼", L"山姆", L"哈士企",
        L"罗恩", L"斯黛拉"
    }},
    {L"猫科动物", {
        L"玛奇朵", L"泰哥", L"加肥", L"利威尔", L"希子", L"嘟嘟", L"玛奈奇", L"苗苗", L"星期天"
    }},
    {L"眼睛大的动物", {
        L"鳄霸", L"地包天", L"阿瓜", L"木木", L"柯蒂斯", L"咕咕", L"奥里", L"咩咩", L"嘟嘟", L"阿宝", L"奥姆诺姆", L"豆豆", L"哈士企"
    }}
    };
public:
    MeRepository();
    ~MeRepository();
    std::map<std::wstring, std::vector<std::wstring>> getMap() override;
};

